In [2]:
import pandas as pd
import sqlalchemy as alch

In [3]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password:  ·········

In [5]:
dbName="sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

#### Check the number of rentals for each customer for May.

In [6]:
query_may = pd.read_sql_query("""
select customer_id, count(rental_id) as num_of_rentals_may
from sakila.rentals_may
group by customer_id
order by count(rental_id) desc
""", engine);
query_may.head()

   customer_id  num_of_rentals_may
0          197                   8
1          506                   7
2          109                   7
3          269                   6
4          239                   6

#### Check the number of rentals for each customer for June

In [7]:
query_june = pd.read_sql_query("""
select customer_id, count(rental_id) as num_of_rentals_june
from sakila.rentals_june
group by customer_id
order by count(rental_id) desc
""", engine);
query_june.head()

   customer_id  num_of_rentals_june
0           31                   11
1          454                   10
2          329                    9
3          295                    9
4          561                    9

#### Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [22]:
def compare_June_May():
    merged = pd.merge(query_may, query_june, how ="outer", on = "customer_id")
    merged.fillna(0, axis =1, inplace=True)

    merged['Check'] = merged['num_of_rentals_may'] < merged['num_of_rentals_june']
    return merged

In [23]:
compare_June_May()

     customer_id  num_of_rentals_may  num_of_rentals_june  Check
0            197                 8.0                  8.0  False
1            506                 7.0                  5.0  False
2            109                 7.0                  5.0  False
3            269                 6.0                  3.0  False
4            239                 6.0                  5.0  False
..           ...                 ...                  ...    ...
593           63                 0.0                  1.0   True
594          598                 0.0                  1.0   True
595          487                 0.0                  1.0   True
596          555                 0.0                  1.0   True
597          335                 0.0                  1.0   True

[598 rows x 4 columns]